Ran Plan for 3 projects:

1. dir: `Project_1` workspace: `default`
1. dir: `Project_2` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `Project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.vm_creation[0].google_compute_instance.vm1: Refreshing state... [id=projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm_creation[0].google_compute_instance.vm1 has been changed
~ resource "google_compute_instance" "vm1" {
        id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1"
      + labels                    = {}
        name                      = "gcloud-vm-using-atlantis-p1"
      + resource_policies         = []
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
        # (18 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vm_creation[0].google_compute_instance.vm1 is tainted, so must be replaced
-/+ resource "google_compute_instance" "vm1" {
      ~ cpu_platform              = "Intel Broadwell" -> (known after apply)
      ~ creation_timestamp        = "2025-07-02T21:55:51.756-07:00" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" -> (known after apply)
      ~ instance_id               = "6240684670674777016" -> (known after apply)
      ~ label_fingerprint         = "vezUS-42LLM=" -> (known after apply)
      - labels                    = {} -> null
      ~ metadata_fingerprint      = "EgwOpssuD4E=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "gcloud-vm-using-atlantis-p1"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" -> (known after apply)
        tags                      = [
            "http-server",
            "https-server",
            "ssh",
        ]
      ~ tags_fingerprint          = "xEi19su0rvw=" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          - force_attach               = false -> null
          ~ guest_os_features          = [
              - "UEFI_COMPATIBLE",
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "GVNIC",
              - "SEV_CAPABLE",
              - "SEV_SNP_CAPABLE",
              - "SEV_LIVE_MIGRATABLE",
              - "SEV_LIVE_MIGRATABLE_V2",
              - "IDPF",
              - "TDX_CAPABLE",
            ] -> (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ architecture                = "X86_64" -> (known after apply)
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-9-v20250611" -> "rocky-linux-9-v20250611"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
              ~ resource_policies           = [] -> (known after apply)
              + snapshot                    = (known after apply)
              ~ type                        = "pd-standard" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/global/networks/default" -> "default"
          + network_attachment          = (known after apply)
          ~ network_ip                  = "10.148.0.25" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/regions/asia-southeast1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project          = "terraform-gcp-463406" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.126.127.165" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          ~ availability_domain         = 0 -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
### 2. dir: `Project_2` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_2`

---
### 3. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
